package homework_41;

/*
Task 4
Построение маршрута.

У вас есть карта прямых рейсов, где ключ — это название города отправления, а значение — город назначения.

Необходимо написать функцию, которая принимает карту рейсов, город отправления и город назначения и возвращает
список городов, через которые проходит маршрут. Если прямого рейса нет,
функция должна пытаться найти маршрут с пересадками.

Условия:
    - Если прямого рейса нет, нужно искать возможные пересадки через другие города.
    - Если маршрут невозможно составить, функция должна возвращать пустой список.
    - Предполагается, что нет циклических маршрутов, и из города можно уехать только в один другой город
      (один к одному соответствие).
 */

public class Task4 {


}

// TODO: доделать!!!