package homework_04;

/*
Напишите программу, которая:

Объявляет переменную типа int и присваивает ей значение 10.
Присваивает значение этой переменной в переменную типа double с именем myDouble.
Выводит значение myDouble на экран.
 */

public class Task01 {

    public static void main(String[] args) {

        int myInt = 10;
        double myDouble = myInt;
        System.out.println("Значение myDouble: " + myDouble);

    }

}
